{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(1, 1, 40, -1)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 2)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 2)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(1, 2)", 
        "pool_type": "max", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[7, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu2", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[17, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu4", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu5", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout2", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[29, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu6", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu7", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout3", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[40, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu8", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution11_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu9", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout4", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[50, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu10", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu11", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout5", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution14_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[60, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu12", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution16_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu13", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout6", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution17_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution17_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[72, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu14", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution18_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution18_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu15", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout7", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution19_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution19_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[83, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu16", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution20_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution20_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu17", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout8", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution21_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution21_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[93, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu18", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution22_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution22_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu19", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout9", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution23_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution23_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[103, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu20", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu21", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout10", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution25_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[113, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu22", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution26_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution26_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu23", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout11", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution27_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution27_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[123, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu24", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution28_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution28_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu25", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout12", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution29_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution29_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[133, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu26", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution30_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution30_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu27", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout13", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution31_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution31_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution31", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[143, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu28", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution32_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution32_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu29", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout14", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution33_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution33_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution33", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[153, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu30", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution34_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution34_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution34", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu31", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout15", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution35_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution35_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution35", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[163, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu32", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution36_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution36_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution36", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu33", 
      "attrs": {"slope": "0.1"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout16", 
      "attrs": {
        "flag": "True", 
        "p": "0.1"
      }, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution37_weight", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution37_bias", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution37", 
      "attrs": {
        "cudnn_off": "True", 
        "cudnn_tune": "off", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
